In [1]:
# importing libraries
import pandas as pd
import numpy as np
import seaborn as sns
import os

In [2]:
# Creating the path
path = r'/Users/monajafizada/Documents/DataAnalytics/A6 advanced analytics and dashboard design/Project Information'

In [3]:
# exporting the data 1
dfDS = pd.read_csv(os.path.join(path, '02 Data', 'PreparedData', 'DeathsbyALLState.csv'), index_col = False)

In [4]:
# exporting the data 2 
dfCS = pd.read_csv(os.path.join(path, '02 Data', 'PreparedData', 'ConfirmedbyALLState.csv'), index_col = False)

In [7]:
dfDS.head()

   Unnamed: 0    State  Deaths
0           0  Alabama      25
1           1  Alabama      49
2           2  Alabama       7
3           3  Alabama      10
4           4  Alabama      15

In [8]:
dfCS.head()

   Unnamed: 0    State  Confirmed
0           0  Alabama       1715
1           1  Alabama       5141
2           2  Alabama        851
3           3  Alabama        638
4           4  Alabama       1580

In [12]:
# merging two Death and Confirmed data
df= pd.merge(dfCS,dfDS, on=["Unnamed: 0"])

In [13]:
df.head()

   Unnamed: 0  State_x  Confirmed  State_y  Deaths
0           0  Alabama       1715  Alabama      25
1           1  Alabama       5141  Alabama      49
2           2  Alabama        851  Alabama       7
3           3  Alabama        638  Alabama      10
4           4  Alabama       1580  Alabama      15

In [14]:
# droping the extra columns
df = df.drop(columns=['Unnamed: 0','State_y'])

In [15]:
df.head()

   State_x  Confirmed  Deaths
0  Alabama       1715      25
1  Alabama       5141      49
2  Alabama        851       7
3  Alabama        638      10
4  Alabama       1580      15

In [17]:
# exporting the melted data
df.to_csv(os.path.join(path,'02 Data','PreparedData','ccdcmerged.csv'))